SergeyLadanov/STM32F746-DISCO_QSPI_FATFS_USB-MSC/Drivers/TC58CVG1/Inc/tc58cvg1_qspi.h
/**
  ******************************************************************************
  * @file    stm32f746g_discovery_qspi.h
  * @author  Florian SAVARD
  * @version V1.0.0
  * @date    15-november-2015
  * @brief   This file contains the common defines and functions prototypes for
  *          the stm32f746g_discovery_qspi.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __TC58CVG1_QSPI_H
#define __TC58CVG1_QSPI_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"
#include "tc58cvg1.h"

/** @addtogroup TC58CVG1
  * @{
  */

/** @addtogroup STM32746G_DISCOVERY
  * @{
  */

/** @addtogroup STM32L476G_DISCOVERY_QSPI
  * @{
  */

/* Exported constants --------------------------------------------------------*/ 
/** @defgroup STM32F746G_DISCOVERY_QSPI_Exported_Constants Exported Constants
  * @{
  */
/* QSPI Error codes */
#define QSPI_OK            ((uint8_t)0x00)
#define QSPI_ERROR         ((uint8_t)0x01)
#define QSPI_BUSY          ((uint8_t)0x02)
#define QSPI_NOT_SUPPORTED ((uint8_t)0x04)
#define QSPI_SUSPENDED     ((uint8_t)0x08)

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup STM32F746G_DISCOVERY_QSPI_Exported_Types Exported Types
  * @{
  */
/* QSPI Info */
typedef struct {
  uint32_t FlashSize;          /*!< Size of the flash */
  uint32_t EraseSectorSize;    /*!< Size of sectors for the erase operation */
  uint32_t EraseSectorsNumber; /*!< Number of sectors for the erase operation */
  uint32_t ProgPageSize;       /*!< Size of pages for the program operation */
  uint32_t ProgPagesNumber;    /*!< Number of pages for the program operation */
} TC58CVG1_QSPI_Info;

/**
  * @}
  */

//TC58CVG1S3HRAIJ

/* Exported functions --------------------------------------------------------*/
/** @defgroup STM32F746G_DISCOVERY_QSPI_Exported_Functions Exported Functions
  * @{
  */
uint8_t TC58CVG1_QSPI_Init        (QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_DeInit      (QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_GetInfo     (TC58CVG1_QSPI_Info *pInfo);

uint8_t TC58CVG1_QSPI_GetFeature(QSPI_HandleTypeDef *hqspi, uint8_t address, uint8_t *pData);
uint8_t TC58CVG1_QSPI_SetFeature(QSPI_HandleTypeDef *hqspi, uint8_t address, uint8_t Data);
uint8_t TC58CVG1_QSPI_ReadPage(QSPI_HandleTypeDef *hqspi, uint32_t RowAddr);
uint8_t TC58CVG1_QSPI_CheckReadPage(QSPI_HandleTypeDef *hqspi, uint32_t RowAddr);
uint8_t TC58CVG1_QSPI_ReadFromBuf(QSPI_HandleTypeDef *hqspi, uint8_t* pData, uint32_t ColAddr, uint32_t Size);
uint8_t TC58CVG1_QSPI_ProgramLoad(QSPI_HandleTypeDef *hqspi, uint8_t* pData, uint32_t ColAddr, uint32_t Size);
uint8_t TC58CVG1_QSPI_ProgramLoadRandom(QSPI_HandleTypeDef *hqspi, uint8_t* pData, uint32_t ColAddr, uint32_t Size);
uint8_t TC58CVG1_QSPI_ProgramExecute(QSPI_HandleTypeDef *hqspi, uint32_t RowAddr);
uint8_t TC58CVG1_QSPI_EraseBlock(QSPI_HandleTypeDef *hqspi, uint32_t BlockAddress);
uint8_t TC58CVG1_QSPI_UnlockAllBlocks(QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_ResetMemory(QSPI_HandleTypeDef *hqspi);
void TC58CVG1_QSPI_EraseChip(QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_HoldDisable(QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_HoldEnable(QSPI_HandleTypeDef *hqspi);
uint8_t TC58CVG1_QSPI_ClearBuffer(QSPI_HandleTypeDef *hqspi);


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F746G_DISCOVERY_QSPI_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
